# Solutions: Pandas Assignment

In [55]:
import pandas as pd
import numpy as np

In [56]:
data_set = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [57]:
data_set

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Question 2.1 (Solution):

Question: Filling Null Values and converting column to int

In [58]:
data_set['FlightNumber'].interpolate(method = 'linear', limit_direction = 'forward', inplace = True)

In [59]:
data_set['FlightNumber'] = data_set['FlightNumber'].apply(lambda x: int(x))

In [60]:
data_set

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# Question 2.2 (Solution):

Question: From_To column - two separate columns! Split to give a new temporary DataFrame with the correct values.

In [61]:
data_set2 = pd.DataFrame()

In [62]:
data_set2['From'], data_set2['To'] = data_set['From_To'].str.split('_', expand = True)[0], data_set['From_To'].str.split('_', expand = True)[1]

In [63]:
data_set2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [64]:
data_set

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [65]:
data_set2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# Question 2.3 (Solution):

Question: capitalisation of the city names

In [66]:
data_set2['From'] = data_set2['From'].apply(lambda x: x.title())

In [67]:
data_set2['To'] = data_set2['To'].apply(lambda x: x.title())

In [68]:
data_set2

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Question 3.4 (Solution):

Question: Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [69]:
data_set.drop('From_To', axis  = 1, inplace = True)

In [70]:
data_set

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [71]:
data_set = pd.concat([data_set, data_set2] ,axis = 1, join = 'outer')

In [72]:
data_set

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Question 2.5 (Solution):

Question: Rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [73]:
data_set['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [74]:
delays = pd.DataFrame([pd.Series(i) for i in data_set.loc[:,'RecentDelays']])

In [75]:
delays.rename(columns = {0: "delay_1",1: "delay_2",2: "delay_3"}, inplace = True)

In [76]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [79]:
data_set

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [80]:
data_set.insert(1,"delay_1", delays['delay_1'])
data_set.insert(2,"delay_2", delays['delay_2'])
data_set.insert(3,"delay_3", delays['delay_3'])

In [81]:
data_set

,FlightNumber,delay_1,delay_2,delay_3,RecentDelays,Airline,From,To
0,10045,23.0,47.0,NaN,"[23, 47]",KLM(!),London,Paris
1,10055,NaN,NaN,NaN,[],<Air France> (12),Madrid,Milan
2,10065,24.0,43.0,87.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,10075,13.0,NaN,NaN,[13],12. Air France,Budapest,Paris
4,10085,67.0,32.0,NaN,"[67, 32]","""Swiss Air""",Brussels,London

In [82]:
del data_set['RecentDelays']

In [83]:
data_set

,FlightNumber,delay_1,delay_2,delay_3,Airline,From,To
0,10045,23.0,47.0,NaN,KLM(!),London,Paris
1,10055,NaN,NaN,NaN,<Air France> (12),Madrid,Milan
2,10065,24.0,43.0,87.0,(British Airways. ),London,Stockholm
3,10075,13.0,NaN,NaN,12. Air France,Budapest,Paris
4,10085,67.0,32.0,NaN,"""Swiss Air""",Brussels,London